<h2>請設計一支程式，在不產生新陣列的狀況下，將一個陣列的元素順序反轉(利用迴圈)</h2>
<ul>
    <li>例：$a=[2,4,6,1,8] 反轉後 $a=[8,1,6,4,2]</li>
</ul>

<?php
$a=[2,5,16,19,8,3];

echo "<pre>";
print_r($a);
echo "<pre>";

for ($i=0; $i < floor(count($a)/2); $i++) { 
    $tmp=$a[$i];
    $a[$i]=$a[count($a)-1-$i];
    $a[count($a)-1-$i]=$tmp;
}

echo "<pre>";
print_r($a);
echo "<pre>";

echo "<pre>";
print_r(array_reverse($a));
echo "<pre>";

?>


<h2>已知西元1024年為甲子年，請設計一支程式，可以接受任一西元年份，輸出對應的天干地支的年別。(利用迴圈)</h2>
<ul>
    <li>天干：甲乙丙丁戊己庚辛壬癸</li>
    <li>地支：子丑寅卯辰巳午未申酉戌亥</li>
    <li>天干地支配對：甲子、乙丑、丙寅….甲戌、乙亥、丙子….</li>
</ul>
<?php
// 定义天干和地支的数组
$sky = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
$land = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
$year=2025;

echo "西元".$year."是";
echo $sky[($year-1024)%10];
echo $land[($year-1024)%12];
echo "年";

?>


<h2>找出五百年內的閏年</h2>
<ul>
    <li>請依照閏年公式找出五百年內的閏年</li>
    <li>使用陣列來儲存閏年</li>
    <li>使用迴圈來印出閏年</li>
</ul>

<?php

$years=[];
for($i=2023;$i<2523;$i++){
    if(($i%4==0 && $i%100 != 0) ||  $i %400 ==0){
        // echo $i."是閏年"; 
        $years[]=$i;  
    }
}

/*
$years=[];
$year=2023;
for($year=2023;$year<2523;$year++){
    if(($year%4==0 && $year%100 != 0) ||  $year %400 ==0){
        echo $year."是閏年"; 
        $years[]=$year;  
    }
}
echo "<hr>";
*/

?>